In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('Bengaluru_House_data.csv')

In [3]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
data.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [6]:
data['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [7]:
data.drop(columns=['society','balcony','area_type'],inplace=True,axis=1)

In [8]:
data['size']=data['size'].fillna('2 bhk')

In [9]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
data['bath']=data['bath'].fillna(data['bath'].median())

In [11]:
data['location'].value_counts()

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

In [12]:
data['location']=data['location'].fillna('Sarjapur  Road ')

In [13]:
data.head()

    availability                  location       size total_sqft  bath   price
0         19-Dec  Electronic City Phase II      2 BHK       1056   2.0   39.07
1  Ready To Move          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2  Ready To Move               Uttarahalli      3 BHK       1440   2.0   62.00
3  Ready To Move        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4  Ready To Move                  Kothanur      2 BHK       1200   2.0   51.00

In [14]:
data.drop(columns='availability',inplace=True,axis=1)

In [15]:
data['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
2 bhk           16
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [16]:
data['bhk']=data['size'].apply(lambda x:int(x.split()[0]))

In [17]:
data.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [18]:
# create function fot sqft mean
def mean_cut(sqft):
    temp=sqft.split('-')
    if len(temp)==2:
        return (float(temp[0])+(float(temp[1])))/2
    else:
        try:
            return float(sqft)
        except:
            return None

In [19]:
data['total_sqft']=data['total_sqft'].apply(mean_cut)

In [20]:
data=data[data.bhk<20]

### Price per sqft

In [21]:
data['price_per_sft']=data['price']*100000/data['total_sqft']
data['price_per_sft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sft, Length: 13318, dtype: float64

In [22]:
data.head()

,location,size,total_sqft,bath,price,bhk,price_per_sft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [23]:
data['location']=data['location'].apply(lambda x:x.strip())
location_count=data['location'].value_counts()
location_count

location
Whitefield                              541
Sarjapur  Road                          400
Electronic City                         304
Kanakpura Road                          273
Thanisandra                             237
                                       ...
Duddanahalli                              1
Doddanakunte                              1
Jogupalya                                 1
Subhash Nagar                             1
Kengeri Satellite Town KHB Apartment      1
Name: count, Length: 1293, dtype: int64

In [24]:
location_less_10=location_count[location_count<=10]
location_less_10

location
Sector 1 HSR Layout                     10
Basapura                                10
Nagadevanahalli                         10
BTM 1st Stage                           10
Nagappa Reddy Layout                    10
                                        ..
Duddanahalli                             1
Doddanakunte                             1
Jogupalya                                1
Subhash Nagar                            1
Kengeri Satellite Town KHB Apartment     1
Name: count, Length: 1052, dtype: int64

In [25]:
data['location']=data['location'].apply(lambda x : 'others' if x in location_less_10 else x)

## Outlier removal

In [26]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sft
count  13272.000000  13318.000000  13318.000000  13318.000000   1.327200e+04
mean    1559.078114      2.684187    112.515704      2.797943   7.906404e+03
std     1237.214493      1.282026    148.903830      1.229083   1.064375e+05
min        1.000000      1.000000      8.000000      1.000000   2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000   4.267260e+03
50%     1276.000000      2.000000     72.000000      3.000000   5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000   7.311582e+03
max    52272.000000     18.000000   3600.000000     19.000000   1.200000e+07

In [27]:
(data['total_sqft']/data['bhk']).describe()

count    13272.000000
mean       575.135008
std        388.200711
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [31]:
data2=data[(data['total_sqft']/data['bhk'])>=300]

In [32]:
data2.head()

,location,size,total_sqft,bath,price,bhk,price_per_sft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [39]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12530 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   location       12530 non-null  object
 1   size           12530 non-null  object
 2   total_sqft     12530 non-null  float64
 3   bath           12530 non-null  float64
 4   price          12530 non-null  float64
 5   bhk            12530 non-null  int64
 6   price_per_sft  12530 non-null  float64
dtypes: float64(4), int64(1), object(2)
memory usage: 783.1+ KB

In [41]:
def remove_outliers_sqft(df):
    df_output= pd.DataFrame()
    for key, subdf in df.groupby("location"):
        m=np.mean(subdf.price_per_sft)
        st = np.std(subdf.price_per_sft)
        gen_df= subdf[(subdf.price_per_sft >= (m-st)) & (subdf.price_per_sft <= (m+st))]
        df_output =pd.concat([df_output, gen_df], ignore_index =True)
    return df_output


data2= remove_outliers_sqft(data2)
data2.describe()

         total_sqft          bath         price           bhk  price_per_sft
count  10301.000000  10301.000000  10301.000000  10301.000000   10301.000000
mean    1508.440608      2.471702     91.286372      2.574896    5659.062876
std      880.694214      0.979449     86.342786      0.897649    2265.774749
min      300.000000      1.000000     10.000000      1.000000    1250.000000
25%     1110.000000      2.000000     49.000000      2.000000    4244.897959
50%     1286.000000      2.000000     67.000000      2.000000    5175.600739
75%     1650.000000      3.000000    100.000000      3.000000    6428.571429
max    30400.000000     16.000000   2200.000000     16.000000   24509.803922

In [46]:
def bhk_outlier_remover(df):
        exclude_indices= np.array([])
        for location, location_df in df.groupby('location'):
            bhk_stats = {}
            for bhk, bhk_df in location_df.groupby('bhk'):
                bhk_stats [bhk] = {
                     'mean': np.mean(bhk_df.price_per_sft), 
                     'std': np.std(bhk_df.price_per_sft),
                    'count': bhk_df.shape[0]
                }
            #print(location,bhk_stats)
            for bhk, bhk_df in location_df.groupby('bhk'):
                stats= bhk_stats.get(bhk-1)
                if stats and stats ['count']>5:
                    exclude_indices= np.append(exclude_indices, bhk_df[bhk_df.price_per_sft<(stats['mean'])].index.values)
        return df.drop(exclude_indices, axis='index')

In [47]:
data2=bhk_outlier_remover(data2)

In [49]:
data2.shape

(7360, 7)

In [76]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7360 entries, 0 to 10300
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7360 non-null   object
 1   total_sqft  7360 non-null   float64
 2   bath        7360 non-null   float64
 3   price       7360 non-null   float64
 4   bhk         7360 non-null   int64
dtypes: float64(3), int64(1), object(1)
memory usage: 345.0+ KB

In [50]:
data2.head()

              location   size  total_sqft  bath  price  bhk  price_per_sft
0  1st Block Jayanagar  4 BHK      2850.0   4.0  428.0    4   15017.543860
1  1st Block Jayanagar  3 BHK      1630.0   3.0  194.0    3   11901.840491
2  1st Block Jayanagar  3 BHK      1875.0   2.0  235.0    3   12533.333333
3  1st Block Jayanagar  3 BHK      1200.0   2.0  130.0    3   10833.333333
4  1st Block Jayanagar  2 BHK      1235.0   2.0  148.0    2   11983.805668

In [52]:
data2.drop(columns=['size','price_per_sft'],inplace=True,axis=1)

In [53]:
data2.to_csv('Final_housing_data.csv')

## Applying algorithms

In [54]:
X=data2.drop(columns=['price'])
y=data2['price']

In [58]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=3)

In [59]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import AdaBoostRegressor
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.linear_model import LinearRegression, Ridge,Lasso
from sklearn.neighbors import KNeighborsRegressor
from sklearn.tree import DecisionTreeRegressor
from xgboost import XGBRegressor

from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

In [68]:
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline

In [63]:
col_trans = make_column_transformer(
    (OneHotEncoder(sparse_output=False, drop='first'), ['location']),
    remainder='passthrough'
)

In [72]:
scaler=StandardScaler()

In [73]:
models = {
    "Linear Regression": LinearRegression(),
    "Lasso": Lasso(),
    "Ridge": Ridge(),
    "K-Neighbors Regressor": KNeighborsRegressor(),
    "Decision Tree": DecisionTreeRegressor(),
    "Random Forest Regressor": RandomForestRegressor(),
    "AdaBoost Regressor": AdaBoostRegressor(),
    "Gradient Boost Regressor": GradientBoostingRegressor(),
    "XGBoost Regressor": XGBRegressor(
    objective='reg:squarederror',
    learning_rate=0.05,
    n_estimators=400,
    max_depth=3,
    subsample=0.8,
    colsample_bytree=0.8,
    reg_alpha=1,
    n_jobs=-1
)

}

In [74]:
##Create a Function to Evaluate Model
def evaluate_model(true, predicted):
    mae = mean_absolute_error(true, predicted)
    mse = mean_squared_error(true, predicted)
    rmse = np.sqrt(mean_squared_error(true, predicted))
    r2_square = r2_score(true, predicted)
    return mae, rmse, r2_square

In [75]:
for name, model in models.items():

    # Build pipeline with preprocessing + model
    pipeline = make_pipeline(col_trans,scaler, model)

    # Train model
    pipeline.fit(X_train, y_train)

    # Predictions
    y_train_pred = pipeline.predict(X_train)
    y_test_pred = pipeline.predict(X_test)

    # Evaluation
    train_mae, train_rmse, train_r2 = evaluate_model(y_train, y_train_pred)
    test_mae, test_rmse, test_r2 = evaluate_model(y_test, y_test_pred)

    print(f"\n{name}")
    print("Training Performance:")
    print(f"  RMSE: {train_rmse:.3f}")
    print(f"  MAE : {train_mae:.3f}")
    print(f"  R2  : {train_r2:.3f}")

    print("Test Performance:")
    print(f"  RMSE: {test_rmse:.3f}")
    print(f"  MAE : {test_mae:.3f}")
    print(f"  R2  : {test_r2:.3f}")
    print("="*40)

Linear Regression
Training Performance:
  RMSE: 32.417
  MAE : 17.391
  R2  : 0.871
Test Performance:
  RMSE: 46.797
  MAE : 18.866
  R2  : 0.802
========================================

Lasso
Training Performance:
  RMSE: 34.395
  MAE : 19.560
  R2  : 0.854
Test Performance:
  RMSE: 48.408
  MAE : 20.710
  R2  : 0.788
========================================

Ridge
Training Performance:
  RMSE: 32.421
  MAE : 17.388
  R2  : 0.871
Test Performance:
  RMSE: 46.827
  MAE : 18.879
  R2  : 0.802
========================================

K-Neighbors Regressor
Training Performance:
  RMSE: 33.931
  MAE : 15.011
  R2  : 0.858
Test Performance:
  RMSE: 65.139
  MAE : 20.777
  R2  : 0.616
========================================

Decision Tree
Training Performance:
  RMSE: 8.193
  MAE : 2.598
  R2  : 0.992
Test Performance:
  RMSE: 56.889
  MAE : 18.933
  R2  : 0.707
========================================

Random Forest Regressor
Training Performance:
  RMSE: 16.095
  MAE : 7.269
  R2  : 0.968
Test Performance:
  RMSE: 52.943
  MAE : 16.763
  R2  : 0.746
========================================

AdaBoost Regressor
Training Performance:
  RMSE: 49.410
  MAE : 37.228
  R2  : 0.700
Test Performance:
  RMSE: 63.670
  MAE : 38.708
  R2  : 0.633
========================================

Gradient Boost Regressor
Training Performance:
  RMSE: 27.103
  MAE : 17.687
  R2  : 0.910
Test Performance:
  RMSE: 53.509
  MAE : 19.624
  R2  : 0.741
========================================

XGBoost Regressor
Training Performance:
  RMSE: 25.946
  MAE : 16.813
  R2  : 0.917
Test Performance:
  RMSE: 56.263
  MAE : 18.925
  R2  : 0.714
========================================

### observations and result changes

As the linear model and ridge model outperformed the xgboost, due to less categorical features, so we will use lr or ridge, but as ridge is better in overfiiting so we will move with it

In [80]:
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import Ridge
from sklearn.pipeline import make_pipeline

ridge = Ridge()

pipeline = make_pipeline(col_trans, ridge)

param_grid = {
    'ridge__alpha': [0.0001, 0.001, 0.01, 0.1, 1, 10, 50, 100, 200]
}

grid = GridSearchCV(
    pipeline,
    param_grid,
    scoring='r2',
    cv=5,
    n_jobs=-1,
    verbose=2
)

grid.fit(X_train, y_train)

print("Best alpha:", grid.best_params_)
print("Best CV Score:", grid.best_score_)

Fitting 5 folds for each of 9 candidates, totalling 45 fits
Best alpha: {'ridge__alpha': 0.0001}
Best CV Score: nan

d:\ml\venv\lib\site-packages\sklearn\model_selection\_search.py:1108: UserWarning: One or more of the test scores are non-finite: [nan nan nan nan nan nan nan nan nan]
  warnings.warn(

In [82]:
best_ridge = grid.best_estimator_

y_pred = best_ridge.predict(X_test)

print("Test R2:", r2_score(y_test, y_pred))
print("MAE:", mean_absolute_error(y_test, y_pred))
print("RMSE:", np.sqrt(mean_squared_error(y_test, y_pred)))

Test R2: 0.8019177584618299
MAE: 18.866123732562993
RMSE: 46.79789623022553

### Deploying the Ridge model

In [83]:
import pickle as pk

In [84]:
pk.dump(best_ridge,open('house_ridge_model.pkl','wb'))